app/controllers/posts_controller.rb

	def create
		raise params.inspect
	  @post = Post.new(params.require(:post).permit(:title, :description))
	  # @post.title = params.require(:post).permit(:title)
	  # @post.description = params.require(:post).permit(:description)
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2015-12-31 19:45:52.559860"], ["updated_at", "2015-12-31 19:45:52.559860"]]